{
    "rooms": {
        "1": {
            "name": "Foothills",
            "description": "You find yourself standing at the base of an enormous mountain.  At its base to the north, there is a massive doorway.  A sign nearby reads \"Keep out!  Definitely no treasure within!\"",
            "exits": {
                "doorway": 3,
                "south": 2
            },
            "objects": ["tablet"],
            "id": 1
        },
        "2": {
            "name": "Foothills",
            "description": "As you begin to leave, you feel the urge for adventure pulling you back...",
            "exits": {
                "north": 1
            },
            "id": 2
        },
        "3": {
            "name": "Dark cave",
            "description": "This seems to be the mouth of a deep cave.  As you peer north into the darkness, you think you hear the echoes of bats deeper within.",
            "exits": {
                "north": 4,
                "south": 1
            },
            "id": 3
        },
        "4": {
            "name": "Dark cave",
            "description": "The cave is somewhat narrow here, and the light from the doorway to the south is quite dim.",
            "exits": {
                "north": 5,
                "south": 3
            },
            "id": 4
        },
        "5": {
            "name": "Dark cave",
            "description": "The cave acoustics dramatically change as you find yourself at a legde above a large chasm.  There is barely enough light here to notice a rope bridge leading out into the dark emptiness.",
            "exits": {
                "bridge": 6,
                "south": 3
            },
            "id": 5
        },
        "6": {
            "name": "Rope bridge",
            "description": "This rope bridge creaks as you walk along it.  You aren't sure how old it is, or whether it can even support your weight.",
            "exits": {
                "continue": 7,
                "back": 5
            },
            "id": 6
        },
        "7": {
            "name": "Falling through the air!",
            "description": "As you continue along the bridge, it snaps!  You try to grab the bridge, but it evades your grasp in the darkness.  You are plummeting quickly downward into the chasm...",
            "exits": {
                "down": 8
            },
            "id": 7
        },
        "8": {
            "name": "Moss cavern",
            "description": "You are standing in a large cavern full of bioluminescent moss.  It must have broken your fall!  The cavern extends to the east and west; at the west end, you think you see a passage leading out of the cavern.",
            "exits": {
                "west": 10,
                "east": 9
            },
            "id": 8
        },
        "9": {
            "name": "Moss cavern",
            "description": "You are standing in a large cavern full of bioluminescent moss.  The cavern extends to the west.",
            "exits": {
                "west": 8
            },
            "objects": ["empty lantern"],
            "id": 9
        },
        "10": {
            "name": "Moss cavern",
            "description": "You are standing in a large cavern full of bioluminescent moss.  The cavern extends to the east.  There is a crevise in the rocks which opens into a passage.",
            "exits": {
                "east": 8,
                "passage": 11
            },
            "id": 10
        },
        "11": {
            "name": "Passage",
            "description": "You are in a crevise on the west wall of the moss cavern.  A dark passage leads further west.  There is a ladder here which leads down into a smaller, moss-filled cavern below.",
            "exits": {
                "cavern": 10,
                "ladder": 12,
                "darkness": 15
            },
            "id": 11
        },
        "12": {
            "name": "Twisty passages",
            "description": "You are in a maze of twisty little passages, all dimly lit by more bioluminescent moss.  There is a ladder here leading up.",
            "exits": {
                "ladder": 11,
                "north": 14,
                "south": 13,
                "east": 19,
                "west": 21
            },
            "id": 12
        },
        "13": {
            "name": "Twisty passages",
            "description": "You are in a maze of little twisty passages, all alike.",
            "exits": {
                "north": 12,
                "south": 14,
                "east": 13
            },
            "id": 13
        },
        "14": {
            "name": "Twisty passages",
            "description": "You are in a twisty maze of little passages, all alike.",
            "exits": {
                "north": 13,
                "south": 12,
                "west": 14
            },
            "id": 14
        },
        "15": {
            "name": "Passage",
            "description": "It is pitch black.  You are likely to be eaten by a grue.",
            "exits": {
                "continue": 16,
                "back": 11
            },
            "id": 15
        },
        "16": {
            "name": "Fumbling around in the darkness",
            "description": "Without a source of light, you have become hopelessly lost and are fumbling around in the darkness.",
            "exits": {
                "forward": 17,
                "back": 17
            },
            "id": 16,
            "deadEnd": true
        },
        "17": {
            "name": "Fumbling around in the darkness",
            "description": "You can't seem to find your way.  However, you do think you hear low growling in the distance.",
            "exits": {
                "run": 18,
                "investigate": 18
            },
            "id": 17,
            "deadEnd": true
        },
        "18": {
            "name": "Panicked and lost",
            "description": "The growling is getting louder.  Did I mention there are Grues down here?",
            "exits": {
                "run": 0,
                "wait": 0,
                "hide": 0
            },
            "id": 18,
            "deadEnd": true
        },
        "19": {
            "name": "Twisty passages",
            "description": "You are in a maze of alike little passages, all twisty.",
            "exits": {
                "north": 20,
                "south": 19,
                "west": 12,
                "east": 16
            },
            "id": 19
        },
        "20": {
            "name": "Twisty passages",
            "description": "You are in a maze of alike twisty passages, all little.",
            "exits": {
                "north": 13,
                "east": 14,
                "south": 0
            },
            "id": 20
        },
        "21": {
            "name": "Twisty passages",
            "description": "You are in a little maze of twisty passages, all alike.",
            "exits": {
                "north": 21,
                "south": 22,
                "east": 12
            },
            "id": 21
        },
        "22": {
            "name": "Twisty passages",
            "description": "You are in a twisty alike of little passages, all maze.",
            "exits": {
                "north": 23,
                "south": 14,
                "west": 13,
                "east": 16
            },
            "id": 22
        },
        "23": {
            "name": "Twisty passages",
            "description": "You are in a maze of twisty little passages, all alike.",
            "exits": {
                "west": 12
            },
            "objects": ["can"],
            "id": 23
        },
        "24": {
            "name": "Passage",
            "description": "You feel that your light source is more than sufficient to keep grues away.",
            "exits": {
                "continue": 0,
                "back": 0
            },
            "id": 24
        },
        "25": {
            "name": "Dark passage",
            "description": "You are in a narrow passage.  There is darkness to the west, but you can barely see a glowing opening to the east.",
            "exits": {
                "west": 0,
                "east": 0
            },
            "id": 25
        },
        "26": {
            "name": "Dark passage",
            "description": "You are in a dark, narrow passage.",
            "exits": {
                "east": 0,
                "west": 0
            },
            "id": 26
        },
        "27": {
            "name": "Dark passage",
            "description": "You are in a dark, narrow passage.  To the west, you spot some vegetation where the passage expands.",
            "exits": {
                "east": 0,
                "west": 0
            },
            "id": 27
        },
        "28": {
            "name": "Ruins",
            "description": "You stand in a large cavern with a huge ruin to the north, overgrown by plant life.  There is a large stone archway to the north acting as the doorway to the ruined complex.  A crevice in the rock to the east leads to an alarmingly dark passageway.",
            "exits": {
                "east": 0,
                "north": 0
            },
            "id": 28
        },
        "29": {
            "name": "Ruins",
            "description": "You are in the once-opulent foyer of a massive ruined complex.  There is a door to the south leading to the overgrowth outside and stairs to the north which lead into a larger hall.",
            "exits": {
                "north": 0,
                "south": 0
            },
            "objects": ["red coin"],
            "id": 29
        },
        "30": {
            "name": "Ruins",
            "description": "You stand in the massive central hall of these ruins.  The walls are crumbling, and vegetation has clearly taken over.  Rooms are attached in all directions.  There is a strange monument in the center of the hall with circular slots and unusual symbols.  It reads:",
            "exits": {
                "north": 35,
                "south": 0,
                "east": 31,
                "west": 33
            },
            "id": 30,
            "deadEnd": true
        },
        "31": {
            "name": "Ruins",
            "description": "You stand in what seems to have once been a dining hall; broken tables and pottery are scattered everywhere.  A staircase here leads down.",
            "exits": {
                "down": 32,
                "west": 30
            },
            "objects": ["concave coin"],
            "id": 31
        },
        "32": {
            "name": "Ruins",
            "description": "This seems to be a kitchen; there are brick stoves and shelves along the wall.  Everything here has fallen into disrepair.",
            "exits": {
                "up": 31
            },
            "objects": ["corroded coin"],
            "id": 32
        },
        "33": {
            "name": "Ruins",
            "description": "You find yourself in what was once the living quarters for the complex.  Many smaller rooms which once had walls to divide them now lay in disarray.  There is a staircase up here.",
            "exits": {
                "up": 34,
                "east": 30
            },
            "objects": ["blue coin"],
            "id": 33
        },
        "34": {
            "name": "Ruins",
            "description": "This was long ago a lavish throne room.  Dried-up fountains and crumbling statues line the walls, and the carved stone throne in the center of the room is falling apart.",
            "exits": {
                "down": 33
            },
            "objects": ["shiny coin"],
            "id": 34
        },
        "35": {
            "name": "Ruins",
            "description": "Because it has been so well-protected, this room hardly shows signs of decay.  The walls are covered in elaborate murals and decorated with precious metals and stones.",
            "exits": {
                "south": 30
            },
            "objects": ["teleporter"],
            "id": 35
        },
        "36": {
            "name": "Synacor Headquarters",
            "description": "You stand in the lobby of what appears to be a really fun place to work!  Sadly, there doesn't seem to be anyone around at the moment, so you make a note to call them later.  The bookshelf here looks like it might have something interesting in it, though.",
            "exits": {
                "outside": 37
            },
            "objects": ["business card", "strange book"],
            "id": 36
        },
        "37": {
            "name": "Synacor Headquarters",
            "description": "It's a warm, sunny day!  While the breeze from Lake Erie is certainly refreshing, you don't see anything here that will help you with your quest.",
            "exits": {
                "inside": 36
            },
            "id": 37
        }
    },
    "currentId": 37,
    "ids": "not JSON compatible"
}